# Pandas excercise
### by Adrian Strzelczyk (287072)

In [163]:
import pandas as pd
dataframe = pd.read_csv('https://raw.githubusercontent.com/edlich/eternalrepo/master/DS-WAHLFACH/countries.csv')
display(dataframe)

       Name     People     Area   BIP Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

##### Basic functions:

In [164]:
print("\n*** Index: ")
dataframe.index

*** Index:

RangeIndex(start=0, stop=5, step=1)

In [165]:
print("\n*** Columns: ")
dataframe.columns

*** Columns:

Index([u'Name', u'People', u'Area', u'BIP', u'Currency'], dtype='object')

In [166]:
print("\n*** Basic statistics: ")
dataframe.describe()

*** Basic statistics:

             People          Area         BIP
count  5.000000e+00  5.000000e+00     5.00000
mean   1.027863e+08  3.907400e+06  2716.20000
std    6.759970e+07  4.904957e+06  1457.86083
min    3.650310e+07  3.013380e+05  1529.00000
25%    6.050172e+07  3.573850e+05  1798.00000
50%    8.252165e+07  3.778350e+05  1850.00000
75%    1.260450e+08  8.515770e+06  3466.00000
max    2.083600e+08  9.984670e+06  4938.00000

In [167]:
print("\n*** And more information: ")
dataframe.mean()

*** And more information:

People    102786293.6
Area        3907399.6
BIP            2716.2
dtype: float64

##### Show last 4 rows:

In [168]:
dataframe.tail(4)

       Name     People     Area   BIP Currency
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

##### Show all rows with EURO:

In [169]:
dataframe[dataframe['Currency'] == 'EUR']

      Name    People    Area   BIP Currency
0  Germany  82521653  357385  3466      EUR
3    Italy  60501718  301338  1850      EUR

##### Show only name and currency in a new data frame:

In [170]:
df2 = dataframe[['Name', 'Currency']]
display(dataframe)
display(df2)

       Name     People     Area   BIP Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

       Name Currency
0   Germany      EUR
1     Japan      YEN
2    Canada      CAD
3     Italy      EUR
4  Brazilia     REAL

##### Show Countries which BIP is greater than 2000:

In [171]:
dataframe[dataframe['BIP'] > 2000]

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN

##### Show countries where inhabitants between 50 and 150 Mio:

In [172]:
dataframe[
      (dataframe['People'] > 50000000) 
    & (dataframe['People'] < 150000000)]

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN
3    Italy   60501718  301338  1850      EUR

##### Rename BIP to Bip:

In [173]:
dataframe = dataframe.rename(columns={'BIP':'Bip'})

##### Sum of all Bip (assuming that all Bip values are in billions USD):

In [174]:
print("Sum of Bip is: %s billions USD" % dataframe['Bip'].sum())

Sum of Bip is: 13581 billions USD

#### Calculate average people of all countries:

In [175]:
print("The average people over all countries is: %s" % dataframe['People'].mean())

The average people over all countries is: 102786293.6

##### Sort by name alphabetically:

In [176]:
dataframe.sort_values('Name')

       Name     People     Area   Bip Currency
4  Brazilia  208360000  8515770  1798     REAL
2    Canada   36503097  9984670  1529      CAD
0   Germany   82521653   357385  3466      EUR
3     Italy   60501718   301338  1850      EUR
1     Japan  126045000   377835  4938      YEN

##### Create new data frame where amount of area is replaced by BIG or SMALL depending on amount:

In [177]:
dataframe3 = dataframe.copy()
dataframe3.loc[dataframe3['Area'] > 1000000, 'Area'] = "BIG"
dataframe3.loc[dataframe3['Area'] <= 1000000, 'Area'] = "SMALL"
display(dataframe)
display(dataframe3)

       Name     People     Area   Bip Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

       Name     People   Area   Bip Currency
0   Germany   82521653  SMALL  3466      EUR
1     Japan  126045000  SMALL  4938      YEN
2    Canada   36503097    BIG  1529      CAD
3     Italy   60501718  SMALL  1850      EUR
4  Brazilia  208360000    BIG  1798     REAL